# a, b, c = 56, 23, 107
# d = 7
#
# print(a + b)
# print(a - c)
# print(b * d)
#
# print(23 / 7)  # обычное деление, результат — частное
# print(23 // 7)  # целочисленное деление, результат — неполное частное
# print(23 % 7)  # взятие остатка, результат — остаток
#
# print(a ** 2)
# print(a ** 3)
# print(a ** 0.5)
# print(a ** (1 / 3))
# print(3 ** 100)
# print(484 ** 0.5)
# print(-a)

# Унарная операция — один операнд (унарный минус: -x, унарный плюс: +x)
# Бинарная операция — два операнда
# Тернарная операция — три операнда (условная операция)