# Любые данные в Python представлены в виде объектов
# Каждый объект имеет тип данных и значение
# Тип данных — это какое-то множество объектов, объединённых общими свойствами и операциями

# Некоторые важные встроенные типы данных в Python:
# — int — целые числа: 1, -1, 2, 3, 0, -2242
# — float — дробные числа: 1.5, 3.1415, -10000.0, 0.00023
# — bool — логический тип: True (истина), False (ложь)
# — str — строка (string), текст: "привет", "Window", "", 'Hello world', "+", '1942194'
# — list — упорядоченный набор объектов: [1, 2, 3, 4]

# — tuple
# — set
# — dict
# — range
