# int — целочисленный тип
# float — вещественный тип
# bool — логический тип

# str — строковый тип
# list — списки
# set — множества
# tuple — кортежи (= неизменяемый список)
# dict — словарь

# Конверсии в int
# float → int: остаётся только целая часть, int(5.3) → 5
# bool → int: int(True) → 1, int(False) → 0
# str → int: int("42304") → 42304
# int(x, base): переводит строку x (число, записанное в системе счисления с основанием base) в тип int

# Конверсии в bool
# Мы получим False только в том случае, если передали какой-то НАЧАЛЬНЫЙ объект:
# 0, 0.0, False, "", [], {}, set(), ()

# Конверсии в str

# Конверсии в list
